/*************************************************************************
**                                                                      **
**                            Programa 4 ex.6                           **
**                                                                      **
*************************************************************************/

 
//****** Includes ********************************************************


//****** Variables *******************************************************

int comptar = 11;

//****** secup ***********************************************************
void setup() {
Serial.begin(9600);     // parlem amb l'arduino a 9600 bps! つ◕_◕ つ
 Serial.print("Ara comptare de 0 a ");
 Serial.println(comptar);
for (int i=0; i <= comptar; i++)
 {
   Serial.print(i);
   Serial.print("-"); //D'aquesta manera sortirà un - entre numeros
   }     
}        

//****** Loop ************************************************************
void loop() {
}
