/*************************************************************************
**                                                                      **
**                            Programa 4 ex.1                           **
**                                                                      **
*************************************************************************/

 
//****** Includes ********************************************************


//****** Variables *******************************************************

int tempAigua = 101;

//****** secup ***********************************************************
void setup() {
Serial.begin(9600);     // parlem amb l'arduino a 9600 bps! :3

  if ( tempAigua > 100)  //quan l'aigua supera als 100C es veu el serial
  {
    Serial.print("Aigua supera els 100C, esta bullint!");
  } 
}         //com que la tempAigua és 101, es veu el serial


//****** Loop ************************************************************
void loop() {

}
